app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["description", "test"], ["price", 34.0], ["category_id", 15], ["created_at", "2023-10-27 14:29:57.311645"], ["updated_at", "2023-10-27 14:29:57.311645"]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "categories" SET "product_count" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["product_count", 1], ["updated_at", "2023-10-27 14:29:57.327504"], ["id", 15]]
---
    def create
        @product = Product.new(product_params)

        if @product.save
            ActiveRecord::Base.transaction do
            @category = Category.find(params[:product][:category_id])
            @category.product_count += 1
            @category.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "categories" SET "product_count" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["product_count", 0], ["updated_at", "2023-10-27 14:30:05.651909"], ["id", 15]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 10]]
---
    def destroy
        @product = Product.find(params[:id])

        ActiveRecord::Base.transaction do
            @category = Category.find(@product.category_id)
            @category.product_count -= 1
            @category.save
            @product.destroy