app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", "test"], ["email", "test@test.test"], ["password_digest", "[FILTERED]"], ["created_at", "2023-10-27 06:35:34.584011"], ["updated_at", "2023-10-27 06:35:34.584011"], ["role", nil]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "admin@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2023-10-26 13:19:49.704511"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)