app/views/products/index.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td>
          <% category = Category.find(product.category_id) %>