app/views/products/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name, prompt: 'Select a category' %>